Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You
have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10
jobs data.
This task will be done in following steps:
1. First get the webpage https://www.shine.com/
2. Enter “Data Analyst” in “Job title, Skills” field and enter “Bangalore” in “enter the location” field.
3. Then click the searchbutton.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.
Note: All of the above steps have to be done in code. No step is to be done manually.

In [1]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings("ignore")
from selenium.webdriver.common.by import By
import time

In [79]:
driver=webdriver.Chrome()

In [88]:
driver.get("https://www.shine.com/")

In [90]:
title=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input")
title.send_keys("Data Analyst")

In [91]:
location=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
location.send_keys("Bangalore")

In [92]:
search=driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search.click()

In [93]:
job_title=[]
job_location=[]
company=[]
job_exp=[]

In [94]:
title=driver.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in title[0:10]:
    title=i.text
    job_title.append(title)

In [95]:
locat=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in locat[0:10]:
    locat=i.text
    job_location.append(locat)

In [96]:
company_name=driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company_name[0:10]:
    company_name=i.text
    company.append(company_name)

In [97]:
experience=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in experience[0:10]:
    experience=i.text
    job_exp.append(experience)

In [98]:
print(len(job_title),len(job_location),len(company),len(job_exp))

10 10 10 10

In [99]:
import pandas as pd

In [100]:
df=pd.DataFrame({"Job Title":job_title,"Location":job_location,"Company Name":company,"Experience":job_exp})

In [101]:
df

,Job Title,Location,Company Name,Experience
0,Lead Data Analyst,Bangalore,ara resources private limited,4 to 9 Yrs
1,Data Analyst,Bangalore\n+3,diraa hr services hiring for mncs,0 to 1 Yr
2,Vacancy For Data Analyst,Bangalore\n+14,yogita staffing solution,0 to 3 Yrs
3,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
4,Data Modeler data,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
5,Data Modeller,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
6,Data Analyst,Bangalore\n+9,v-tech data outsourcing,0 to 2 Yrs
7,Data Modeler Bangalore,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
8,Data Modeler,Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs
9,Clinical Data Analyst,Bangalore\n+4,quiscon biotech,0 to 2 Yrs

Q2:Write a python program to scrape data for “Data Scientist” Job position in“Bangalore” location. You
have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.
This task will be done in following steps:
1. First get the webpage https://www.shine.com/
2. Enter “Data Scientist” in “Job title, Skills” field and enter “Bangalore” in “enter thelocation” field.
3. Then click the search button.
4. Then scrape the data for the first 10 jobs results you get.
5. Finally create a dataframe of the scraped data.
Note: All of the above steps have to be done in code. No step is to be done manually

In [102]:
driver1=webdriver.Chrome()

In [111]:
driver1.get("https://www.shine.com/")

In [113]:
job_title=driver1.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input')
job_title.send_keys("Data Scientist")

In [114]:
job_location=driver1.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input')
job_location.send_keys('Bangalore')

In [115]:
search1=driver1.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search1.click()

In [116]:
title=[]
locat=[]
name=[]

In [117]:
job=driver1.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in job[0:10]:
    job=i.text
    title.append(job)

In [118]:
locator=driver1.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in locator[0:10]:
    locator=i.text
    locat.append(locator)

In [119]:
company=driver1.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in company[0:10]:
    company=i.text
    name.append(company)

In [120]:
print(len(title),len(locat),len(name))

10 10 10

In [121]:
import pandas as pd

In [122]:
df1=pd.DataFrame({"Job Title":title,"Location":locat,"Company's Name":name})

In [123]:
df1

,Job Title,Location,Company's Name
0,Data Scientist,Bangalore\n+4,acme services private limited
1,Data Scientist,Bangalore,ltimindtree limited
2,Lead Data Scientist/ Principal Data Scientist,Bangalore\n+1,fractal
3,Vacancy For Data Scientist Fresher and Experience,Bangalore\n+14,yogita staffing solution
4,Senior Data Scientist,Bangalore\n+1,neostats
5,Lead Data Scientist,Bangalore\n+1,aereo
6,Data Scientist,Bangalore\n+7,people staffing solutions
7,Data Scientist Urgent Vacancy,Bangalore\n+14,yogita staffing solution
8,Data Scientist,Bangalore\n+2,diraa hr services
9,Pharma Data Scientist,Bangalore\n+4,quiscon biotech

Q3: In this question you have to scrape data using the filters available on the webpage
 You have to use the location and salary filter.
You have to scrape data for “Data Scientist” designation for first 10 job results.
You have to scrape the job-title, job-location, company name, experience required.
The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs
The task will be done as shown in the below steps:
1. first get the web page https://www.shine.com/
2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.
3. Then click the search button.
4. Then apply the location filter and salary filter by checking the respective boxes
5. Then scrape the data for the first 10 jobs results you get.
6. Finally create a dataframe of the scrapeddata.
Note: All of the above steps have to be done in code. No step is to be done manually

In [2]:
driver2=webdriver.Chrome()

In [12]:
driver2.get("https://www.shine.com/")

In [54]:
designation=driver2.find_element(By.XPATH,"/html/body/div/div[1]/div/div/div[1]/div[1]/div/div[2]/div/div[1]/form/div/div[1]/ul[1]/li[1]/div/input")
designation.send_keys("Data Scientist")

In [55]:
location=driver2.find_element(By.XPATH,"/html/body/div/div[1]/div/div/div[1]/div[1]/div/div[2]/div/div[1]/form/div/div[1]/ul[1]/li[2]/div/input")
location.send_keys("Delhi-Ncr Region")

In [56]:
salary=driver2.find_element(By.XPATH,"/html/body/div/div[1]/div/div/div[1]/div[1]/div/div[2]/div/div[1]/form/div/div[1]/ul[2]/li[1]/div/input[1]")
salary.send_keys("3-6")

In [57]:
search=driver2.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search.click()

In [75]:
job_title=[]
job_location=[]
company_name=[]
experience=[]

In [76]:
title=driver2.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in title[0:10]:
    title=i.text
    job_title.append(title)

In [77]:
loc=driver2.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc[0:10]:
    loc=i.text
    job_location.append(loc)

In [78]:
name=driver2.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in name[0:10]:
    name=i.text
    company_name.append(name)

In [79]:
exp=driver2.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp[0:10]:
    exp=i.text
    experience.append(exp)

In [80]:
print(len(job_title),len(job_location),len(company_name),len(experience))

10 10 10 10

In [62]:
import pandas as pd

In [81]:
df3=pd.DataFrame({"Job Title":job_title,"Location":job_location,"Company Name":company_name,"Experience":experience})

In [83]:
df3

,Job Title,Location,Company Name,Experience
0,Data Scientist,Noida\n+1,thescholarhat,1 to 3 Yrs
1,DataNeuron - Senior Data Scientist - NLP,Delhi,dataneuron,3 to 4 Yrs
2,Data Scientist,Delhi\n+4,acme services private limited,3 to 5 Yrs
3,Senior Data Scientist,Delhi,roadzen,5 to 9 Yrs
4,Data Scientist,Delhi,adept global,3 to 7 Yrs
5,Senior/Lead Data Scientist- Noida/Bangalore/Hy...,Noida\n+1,techneplus,3 to 8 Yrs
6,Data Scientist,Delhi,scrolltab,4 to 8 Yrs
7,Data Scientist,Noida\n+1,info edge india ltd,1 to 5 Yrs
8,Data Scientist at WinZO,Delhi,winzone technology pvt ltd,0 to 3 Yrs
9,Immediate opening for Data Scientist- Delhi (H...,Delhi,htc global services,3 to 5 Yrs

Q3: In this question you have to scrape data using the filters available on the webpage
 You have to use the location and salary filter.
You have to scrape data for “Data Scientist” designation for first 10 job results.
You have to scrape the job-title, job-location, company name, experience required.
The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs
The task will be done as shown in the below steps:
1. first get the web page https://www.shine.com/
2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.
3. Then click the search button.
4. Then apply the location filter and salary filter by checking the respective boxes
5. Then scrape the data for the first 10 jobs results you get.
6. Finally create a dataframe of the scrapeddata.
Note: All of the above steps have to be done in code. No step is to be done manually.

In [41]:
driver4=webdriver.Chrome()

In [42]:
driver4.get("https://www.shine.com/")

In [44]:
titles=driver4.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input')
titles.send_keys("Data Scientist")

In [45]:
click=driver4.find_element(By.CLASS_NAME,'searchForm_btnWrap_advance__VYBHN')
click.click()

In [46]:
locbox=driver4.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div/ul/li[1]/button')
locbox.click()

In [54]:
location=driver4.find_element(By.XPATH,'/html/body/div[3]/div/div/div/div[3]/div/div/div/ul/li[1]/input')
location.send_keys("Delhi")

In [55]:
check=driver4.find_element(By.XPATH,'/html/body/div[3]/div/div/div/div[3]/div/div/div/ul/li[2]/span/label')
check.click()

In [56]:
result=driver4.find_element(By.XPATH,'/html/body/div[3]/div/div/div/div[4]/button[2]')
result.click()

In [58]:
salaryicon=driver4.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div/ul/li[3]/button')
salaryicon.click()

In [60]:
salaryamount=driver4.find_element(By.XPATH,'/html/body/div[3]/div/div/div/div[3]/div/div/div/ul/li[1]/input')
salaryamount.send_keys("3 To 5 Lakh")

In [61]:
checksalary=driver4.find_element(By.XPATH,'/html/body/div[3]/div/div/div/div[3]/div/div/div/ul/li[2]/span/label')
checksalary.click()

In [62]:
results2=driver4.find_element(By.XPATH,'/html/body/div[3]/div/div/div/div[4]/button[2]')
results2.click()

In [83]:
job_title=[]

In [84]:
job=driver4.find_elements(By.XPATH,'//h2[@itemprop="name"]')
for i in job[0:10]:
    job=i.text
    job_title.append(job)

In [85]:
print(len(job_title))

10

In [86]:
import pandas as pd

In [87]:
df4=pd.DataFrame({"Job Title":job_title})

In [88]:
df4

                           Job Title
0                     Data Scientist
1              Clinical Data Analyst
2             Bioanalytical Research
3  Bioanalytical Research Associates
4           Clinical Analyst Fresher
5           Clinical Data Management
6    Junior Clinical Data Management
7                      Data Engineer
8                    Biostatistician
9       Clinical Document Specialist

In [89]:
location=[]

In [90]:
loc=driver4.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc[0:10]:
    loc=i.text
    location.append(loc)

In [91]:
df5=pd.DataFrame({"Location":location})

In [92]:
df5

     Location
0   Delhi\n+4
1   Delhi\n+6
2   Delhi\n+6
3   Delhi\n+6
4   Delhi\n+6
5   Delhi\n+6
6   Delhi\n+6
7   Delhi\n+9
8  Delhi\n+17
9   Delhi\n+6

In [93]:
name=[]

In [94]:
cmp=driver4.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for i in cmp[0:10]:
    cmp=i.text
    name.append(cmp)

In [108]:
exp1=[]

In [109]:
expr=driver4.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in expr[0:10]:
    expr=i.text
    exp1.append(expr)

In [110]:
df6=pd.DataFrame({"Job Title":job_title,"Location":location,"Company name":name,"Experience":exp1})

In [111]:
df6

,Job Title,Location,Company name,Experience
0,Data Scientist,Delhi\n+4,acme services private limited,3 to 5 Yrs
1,Clinical Data Analyst,Delhi\n+6,techno endura,0 to 1 Yr
2,Bioanalytical Research,Delhi\n+6,techno endura,0 to 1 Yr
3,Bioanalytical Research Associates,Delhi\n+6,techno endura,0 to 1 Yr
4,Clinical Analyst Fresher,Delhi\n+6,techno endura,0 to 1 Yr
5,Clinical Data Management,Delhi\n+6,techno endura,0 to 1 Yr
6,Junior Clinical Data Management,Delhi\n+6,techno endura,0 to 1 Yr
7,Data Engineer,Delhi\n+9,future solution centre,10 to 20 Yrs
8,Biostatistician,Delhi\n+17,national seeds corporation limited,2 to 7 Yrs
9,Clinical Document Specialist,Delhi\n+6,techno endura,0 to 1 Yr

Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
6. Brand
7. ProductDescription
8. Price
The attributes which you have to scrape is ticked marked in the below image.
To scrape the data you have to go through following steps:
1. Go to Flipkart webpage by url :https://www.flipkart.com/
2. Enter “sunglasses” in the search fieldwhere “search for products, brands and more” is written and
click the search icon
3. After that you will reach to the page having a lot of sunglasses. From this page you can scrap the
required data as usual.
4. After scraping data from the first page, go to the “Next” Button at the bottom other page , then
click on it.
5. Now scrape data from this page as usual
6. Repeat this until you get data for 100sunglasses.
Note: That all of the above steps have to be done by coding only and not manually.

In [2]:
driver5=webdriver.Chrome()

In [3]:
driver5.get("https://www.flipkart.com/")

In [4]:
product=driver5.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input')
product.send_keys("sunglasses")

In [5]:
search=driver5.find_element(By.CLASS_NAME,'_2iLD__')
search.click()

In [15]:
brandname=[]
discription=[]
totalprice=[]
discountinper=[]

In [16]:
brnd=driver5.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brnd:
    brnd=i.text
    brandname.append(brnd)

In [17]:
print(len(brandname))

40

In [20]:
discrip=driver5.find_elements(By.XPATH,'//div[@class="_2B099V"]/a')
for i in discrip[0:40]:
    discrip=i.text
    discription.append(discrip)

In [21]:
print(len(discription))

40

In [22]:
prc=driver5.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in prc:
    prc=i.text
    totalprice.append(prc)

In [24]:
print(len(totalprice))

40

In [27]:
dcnt=driver5.find_elements(By.XPATH,'//div[@class="_3Ay6Sb"]')
for i in dcnt:
    dcnt=i.text
    discountinper.append(dcnt)

In [28]:
print(len(discountinper))

40

In [29]:
dffirst=pd.DataFrame({"Brand'Name":brandname,"Discription":discription,"Total Price":totalprice,"Discount":discountinper})

In [30]:
dffirst

,Brand'Name,Discription,Total Price,Discount
0,Lenskart STUDIO,"Polarized, UV Protection Sports Sunglasses (55)","₹1,429",59% off
1,Lenskart STUDIO,"₹1,429₹3,50059% off","₹1,429",59% off
2,SRPM,"Polarized, UV Protection Aviator Sunglasses (51)",₹149,88% off
3,Fastrack,"₹1,429₹3,50059% off",₹599,45% off
4,Elligator,UV Protection Wayfarer Sunglasses (50),₹149,70% off
5,VINCENT CHASE,"₹149₹1,29988% off",₹523,73% off
6,Bembika,UV Protection Wayfarer Sunglasses (58),₹189,36% off
7,Eyewearlabs,"₹599₹1,09945% off","₹2,199",38% off
8,ROADWAY,UV Protection Retro Square Sunglasses (54),₹129,87% off
9,Elligator,₹149₹49970% off,₹169,83% off
10,Singco India,by Lenskart UV Protection Wayfarer Sunglasses ...,₹249,91% off
11,Singco India,"₹523₹1,99973% off",₹375,84% off
12,Rich Club,UV Protection Spectacle Sunglasses (Free Size),₹487,62% off
13,emonex,₹189₹29936% off,₹199,83% off
14,CLICKEDIN,"Polarized, UV Protection Rectangular Sunglasse...",₹221,72% off
15,Elligator,"₹2,199₹3,59938% off",₹149,88% off
16,ROYAL SON,"UV Protection Retro Square, Wayfarer, Sports S...",₹359,76% off
17,Eyewearlabs,₹129₹99987% off,"₹1,236",65% off
18,VALWICK,"UV Protection, Mirrored Wayfarer Sunglasses (52)",₹399,76% off
19,Elligator,₹169₹99983% off,₹149,75% off
20,Singco India,Mirrored Wayfarer Sunglasses (50),₹249,87% off
21,Singco India,"₹249₹2,99991% off",₹499,80% off
22,VINCENT CHASE,"Polarized, UV Protection Wayfarer, Retro Squar...",₹499,75% off
23,OAKLEY,"₹375₹2,49984% off","₹4,899",34% off
24,DEIXELS,UV Protection Retro Square Sunglasses (54),₹187,68% off
25,Rich Club,"₹487₹1,29962% off",₹394,80% off
26,Hooper,UV Protection Retro Square Sunglasses (55),₹599,70% off
27,GANSTA,"₹199₹1,19983% off",₹292,85% off
28,PIRASO,UV Protection Retro Square Sunglasses (Free Size),₹279,82% off
29,PIRASO,₹221₹79972% off,₹210,86% off
30,Eyenaks,UV Protection Wayfarer Sunglasses (53),₹346,76% off
31,Lenskart STUDIO,"₹149₹1,29988% off","₹1,199",65% off
32,VINCENT CHASE,Mirrored Aviator Sunglasses (58),₹499,75% off
33,Elligator,"₹359₹1,49976% off",₹168,87% off
34,FEMISH,"Polarized, UV Protection Wayfarer Sunglasses (51)",₹399,60% off
35,Fastrack,"₹1,236₹3,59965% off",₹659,26% off
36,ROYAL SON,UV Protection Retro Square Sunglasses (18),₹594,70% off
37,Eyewearlabs,"₹399₹1,69976% off","₹1,299",63% off
38,VINCENT CHASE,"UV Protection Cat-eye, Retro Square, Oval, Rou...",₹811,59% off
39,PIRASO,₹149₹59975% off,₹299,88% off

In [31]:
next=driver5.find_element(By.CLASS_NAME,'_1LKTO3')
next.click()

In [32]:
nextbrand=driver5.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in nextbrand:
    nextbrand=i.text
    brandname.append(nextbrand)

In [33]:
print(len(brandname))

80

In [34]:
nextdiscription=driver5.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
for i in nextdiscription:
    nextdiscription=i.text
    discription.append(nextdiscription)

In [35]:
print(len(discription))

80

In [36]:
nextprice=driver5.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in nextprice:
    nextprice=i.text
    totalprice.append(nextprice)

In [37]:
print(len(totalprice))

80

In [38]:
nextdis=driver5.find_elements(By.XPATH,'//div[@class="_3Ay6Sb"]')
for i in nextdis:
    nextdis=i.text
    discountinper.append(nextdis)

In [41]:
print(len(discountinper))

80

In [42]:
dffirst=pd.DataFrame({"Brand'Name":brandname,"Discription":discription,"Total Price":totalprice,"Discount":discountinper})

In [43]:
dffirst

,Brand'Name,Discription,Total Price,Discount
0,Lenskart STUDIO,"Polarized, UV Protection Sports Sunglasses (55)","₹1,429",59% off
1,Lenskart STUDIO,"₹1,429₹3,50059% off","₹1,429",59% off
2,SRPM,"Polarized, UV Protection Aviator Sunglasses (51)",₹149,88% off
3,Fastrack,"₹1,429₹3,50059% off",₹599,45% off
4,Elligator,UV Protection Wayfarer Sunglasses (50),₹149,70% off
...,...,...,...,...
75,VINCENT CHASE,"by Lenskart Polarized, UV Protection Round Sun...",₹759,62% off
76,PROVOGUE,UV Protection Round Sunglasses (Free Size),₹634,75% off
77,Singco India,"Riding Glasses, UV Protection Clubmaster, Wayf...",₹317,84% off
78,PIRASO,UV Protection Retro Square Sunglasses (54),₹232,85% off
79,Lenskart Boost,UV Protection Sports Sunglasses (55),"₹1,899",45% off

In [44]:
nextclick=driver5.find_element(By.XPATH,'/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[12]')
nextclick.click()

In [105]:
brandlast

'VINCENT CHASE'

In [45]:
lastdis=driver5.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in lastdis[0:20]:
    lastdis=i.text
    discription.append(lastdis)

In [47]:
print(len(discription))

100

In [48]:
lastbra=driver5.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in lastbra[0:20]:
    lastbra=i.text
    brandname.append(lastbra)

In [49]:
print(len(brandname))

100

In [50]:
price3=driver5.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in price3[0:20]:
    price3=i.text
    totalprice.append(price3)

In [51]:
print(len(totalprice))

100

In [52]:
disct=driver5.find_elements(By.XPATH,'//div[@class="_3Ay6Sb"]')
for i in disct[0:20]:
    disct=i.text
    discountinper.append(disct)

In [53]:
print(len(discountinper))

100

In [55]:
dffirst=pd.DataFrame({"Brand'Name":brandname,"Discription":discription,"Total Price":totalprice,"Discount":discountinper})

In [56]:
dffirst

,Brand'Name,Discription,Total Price,Discount
0,Lenskart STUDIO,"Polarized, UV Protection Sports Sunglasses (55)","₹1,429",59% off
1,Lenskart STUDIO,"₹1,429₹3,50059% off","₹1,429",59% off
2,SRPM,"Polarized, UV Protection Aviator Sunglasses (51)",₹149,88% off
3,Fastrack,"₹1,429₹3,50059% off",₹599,45% off
4,Elligator,UV Protection Wayfarer Sunglasses (50),₹149,70% off
...,...,...,...,...
95,BKGE,BKGE,₹159,84% off
96,ROYAL SON,ROYAL SON,₹594,70% off
97,Eyewearlabs,Eyewearlabs,"₹1,299",63% off
98,Singco India,Singco India,₹317,84% off
99,ROZZETTA CRAFT,ROZZETTA CRAFT,₹459,79% off

Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:
https://www.flipkart.com/apple-iphone-11-black-64-gb/productreviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market
place=FLIPKART
As shown in the above page you have to scrape the tick marked attributes. These are:
1. Rating
2. Review summary
3. Full review
4. You have to scrape this data for first 100reviews.
Note: All the steps required during scraping should be done through code only and not manually.

In [2]:
driver6=webdriver.Chrome()

In [13]:
driver6.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market")

In [61]:
review=driver6.find_element(By.CLASS_NAME,'_27M-vq')

In [16]:
ratings=[]

In [18]:
start=0
end=10
for page in range(start,end):
    rat=driver6.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    for i in rat[0:100]:
        rat=i.text
        ratings.append(rat)
next_btn=driver6.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[11]')
next_btn.click()

In [10]:
import pandas as pd

In [20]:
df6=pd.DataFrame({"Rating":ratings})

In [21]:
df6

   Rating
0       5
1       5
2       5
3       5
4       5
..    ...
95      5
96      5
97      5
98      5
99      5

[100 rows x 1 columns]

In [22]:
review=[]

In [23]:
start=0
end=10
for page in range(start,end):
    reviews=driver6.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    for i in reviews[0:100]:
        reviews=i.text
        review.append(reviews)
next_btn=driver6.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[11]')
next_btn.click()
time.sleep(3)

In [24]:
print(len(review))

100

In [25]:
summary=[]

In [26]:
start=0
end=10
for page in range(start,end):
    sum=driver6.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
    for i in sum[0:100]:
        sum=i.text
        summary.append(sum)
next_btn=driver6.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[11]')
next_btn.click()
time.sleep(3)

In [27]:
print(len(summary))

100

In [28]:
import pandas as pd

In [29]:
dffinal=pd.DataFrame({"Rating":ratings,"Review summary":review,"Full review":summary})

In [30]:
dffinal

,Rating,Review summary,Full review
0,5,Just wow!,It’s really awesome
1,5,Worth every penny,Excellent Phone.
2,5,Best in the market!,very good camera quality
3,5,Wonderful,NYC
4,5,Classy product,iPhone 11 is a good phone. Not a very big diff...
...,...,...,...
95,5,Terrific,It’s very good battery life and display and vi...
96,5,Terrific purchase,Value for money 🖤🖤
97,5,Perfect product!,"Go for iPhone 11 , if confused between iPhone ..."
98,5,Perfect product!,Good product 👌I love iPhone
99,5,Fabulous!,Really satisfied with the Product I received.....

Q6: Scrape data forfirst 100 sneakers you find whenyou visit flipkart.com and search for “sneakers” inthe
search field.
You have to scrape 3 attributes of each sneaker:
1. Brand
2. ProductDescription
3. Price
As shown in the below image, you have to scrape the above attributes.

In [57]:
driver7=webdriver.Chrome()

In [58]:
driver7.get('https://www.flipkart.com/?affid=admingopai&affExtParam1=FF52BCDF13D911E&affExtParam2=1158&cmpid=sem_3856208402_Mobiles_dsa_goog&gclid=CjwKCAiAk9itBhASEiwA1my_65H_zDDLbJdEH-bOJyGNsuMR_vbiUNvAlYQFsk6O4uFtubwmSpLlERoCPwAQAvD_BwE')

In [59]:
sneaker=driver7.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input')
sneaker.send_keys('sneakers')

In [60]:
search=driver7.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button')
search.click()

In [61]:
Brand=[]
Product=[]
Price=[]

In [63]:
start=0
end=4
for page in range(start,end):
    brnd=driver7.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brnd[0:100]:
        brnd=i.text
        Brand.append(brnd)
    prod=driver7.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in prod[0:100]:
        prod=i.text
        Product.append(prod)
    pri=driver7.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in pri[0:100]:
        pri=i.text
        Price.append(pri)
    next_btn=driver7.find_element(By.XPATH,'/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[11]')
    next_btn.click()
    time.sleep(3)

In [64]:
print(len(Brand),len(Product),len(Price))

238 169 200

In [88]:
Brand=brand[:100]

In [89]:
Product=product[:100]

In [90]:
Price=price[:100]

In [91]:
df4=pd.DataFrame({"Brand":Brand,"Product":Product,"Price":Price})

In [93]:
df4

       Brand                                            Product   Price
0    BIG FOX      Modern Trendy Sneakers Shoes Sneakers For Men    ₹299
1    BIG FOX             2 Combo Sneaker Shoes Sneakers For Men    ₹537
2     Shozie  Trending Stylish Casual Outdoor Sneakers Shoes...    ₹299
3     CAMPUS               Modern Trendy Shoes Sneakers For Men    ₹299
4     ADIDAS                                 Sneakers For Women    ₹399
..       ...                                                ...     ...
95      PUMA  Sports shoes for men|Stylish Casual sport shoe...  ₹2,070
96  Roadster  Premium Ankle Length Black Denim Boots Sneaker...    ₹899
97      PUMA                   Offbeat Classic Sneakers For Men    ₹287
98    CAMPUS                             OG-09 Sneakers For Men    ₹999
99      PUMA                  Melanite Slip on Sneakers For Men  ₹3,534

[100 rows x 3 columns]

Q7: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then
set CPU Type filter to “Intel Core i7” as shown in the below image:
    After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop:
1. Title
2. Ratings
3. Price

In [2]:
driver8=webdriver.Chrome()

In [3]:
driver8.get("https://www.amazon.in/")

In [4]:
field=driver8.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input')
field.send_keys("Laptop")

In [5]:
search=driver8.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input')
search.click()

In [6]:
filter=driver8.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[5]/ul[19]/span/span[10]/li/span/a/span')


filter.click()

In [59]:
Title=[]
Rating=[]
Price=[]

In [68]:
title=driver8.find_elements(By.XPATH,'//div[@data-cy="title-recipe"]')
for i in title[0:10]:
    title=i.text
    Title.append(title)

In [69]:
len(Title)

10

In [18]:
rating=driver8.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div[1]/div/span[1]/div[1]/div[3]/div/div/span/div/div/div/div[2]/div/div/div[2]/div[1]/span[2]/a/span')


rating.click()

In [27]:
rat=driver8.find_element(By.XPATH,'//span[@class="a-size-base a-color-base"]')
Rating.append(rat.text)

In [29]:
Rating

[<selenium.webdriver.remote.webelement.WebElement (session="ca7c56af85e4f927c645270172fa744d", element="6FFBC10C1C219124DE3BC29086B6FF02_element_9542")>,
 'or']

In [75]:
RATING=[]

In [76]:
ratings_box=driver8.find_elements(By.XPATH,'//div[@class="a-row a-size-small"]/span')
for i in ratings_box[0:10]:
    rating_box=i.text
    
    RATING.append(str(rating_box))

In [77]:
len(RATING)

10

In [54]:
product_ratings

['',
 '1,273',
 '',
 '198',
 '',
 '6,187',
 '',
 '162',
 '',
 '361',
 '',
 '1,273',
 '',
 '198',
 '',
 '6,187',
 '',
 '162',
 '',
 '361',
 '',
 '1,273',
 '',
 '198',
 '',
 '6,187',
 '',
 '162',
 '',
 '361']

In [60]:
price=driver8.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in price[0:10]:
    price=i.text
    Price.append(price)

In [63]:
len(Price)

10

In [78]:
df8=pd.DataFrame({'Title':Title,'Rating':RATING,'Price':Price})

In [80]:
df8

                                               Title Rating   Price
0  ASUS VivoBook 15 (2021), 15.6-inch (39.62 cm) ...         22,990
1  Lenovo V15 Intel Celeron N4500 15.6" (39.62 cm...  1,273  22,890
2  Chuwi HeroBook Pro 14.1'' Laptop, 8GB RAM 256G...         17,990
3  HP Laptop 15s, Intel Celeron, 15.6-inch (39.6 ...    198  29,490
4  HP Chromebook X360 Intel Celeron N4120 14 inch...         27,990
5  Lenovo IdeaPad 1 Intel Core Celeron N4020 14" ...  6,187  20,990
6  Lenovo IdeaPad D330 Intel Celeron N4020 10.1" ...         24,990
7  Lenovo IdeaPad Slim 1 Intel Celeron N4020 14" ...    162  26,190
8  AXL VayuBook Laptop 14.1 Inch FHD IPS Display ...         13,990
9  AVITA Laptop PURA S102 15.6 INCH CELERON 8GB R...    361  20,980

8: Write a python program to scrape data for Top 1000 Quotes of All Time.
The above task will be done in following steps:
1. First get the webpagehttps://www.azquotes.com/
2. Click on TopQuotes
3. Than scrap a) Quote b) Author c) Type Of QuotesQ

In [42]:
drivers=webdriver.Chrome()

In [43]:
drivers.get('https://www.azquotes.com/')

In [44]:
click=drivers.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
click.click()

In [62]:
qoute12=[]
auther12=[]
types12=[]

In [63]:
start=0
end=1
for page in range(start,end):
    qoutes=drivers.find_elements(By.XPATH,'//a[@class="title"]')
    for i in qoutes:
        qoutes=i.text
        qoute1.append(qoutes)
    authers=drivers.find_elements(By.XPATH,'//div[@class="author"]/a')
    for i in authers:
        authers=i.text
        auther1.append(authers)
    type=drivers.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in type:
        type=i.text
        types1.append(type)
    
    next_btn=drivers.find_element(By.XPATH,'/html/body/div[1]/div[2]/div/div/div/div[1]/div/div[3]/li[12]')
    next_btn.click()
    time.sleep(3)

In [64]:
start=0
end=8
for page in range(start,end):
    qoutes1=drivers.find_elements(By.XPATH,'//a[@class="title"]')
    for i in qoutes1:
        qoutes1=i.text
        qoute12.append(qoutes1)
    authers1=drivers.find_elements(By.XPATH,'//div[@class="author"]/a')
    for i in authers1:
        authers1=i.text
        auther12.append(authers1)
    type1=drivers.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in type1:
        type1=i.text
        types12.append(type1)
    
    next_btn=drivers.find_element(By.XPATH,'/html/body/div[1]/div[2]/div/div/div/div[1]/div/div[3]/li[13]/a')
    next_btn.click()
    time.sleep(2)

In [65]:
dfall=pd.DataFrame({"Quote":qoute12,"Auther":auther12,"Type Of Quotes":types12})

In [66]:
dfall

,Quote,Auther,Type Of Quotes
0,Can words describe the fragrance of the very b...,Neltje Blanchan,"Spring, April, Fragrance"
1,Faith is to believe what you do not see; the r...,Saint Augustine,"Inspirational, Faith, Spiritual"
2,"When everything seems to be going against you,...",Henry Ford,"Inspirational, Motivational, Positive"
3,"I have found that if you love life, life will ...",Arthur Rubinstein,"Love, Inspirational, Life"
4,To disarm the people... was the best and most ...,George Mason,"Strength, Peace, Gun"
...,...,...,...
795,To love means loving the unlovable. To forgive...,Gilbert K. Chesterton,"Love, Inspirational, Success"
796,Be brave. Take risks. Nothing can substitute e...,Paulo Coelho,"Encouraging, Courage, Inspiration"
797,"If you really want to do something, you'll fin...",Jim Rohn,"Inspirational, Motivational, Success"
798,It is neither wealth nor splendor; but tranqui...,Thomas Jefferson,"Life, Happiness, Work"
799,A thousand words will not leave so deep an imp...,Henrik Ibsen,"Inspirational, Inspiring, Positivity"

Q9: Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead,
Term of office, Remarks) from https://www.jagranjosh.com/.
This task will be done in following steps:
1. First get the webpagehttps://www.jagranjosh.com/
2. Then You have to click on the GK option
3. Then click on the List of all Prime Ministers of India
4. Then scrap the mentioned data and make theDataFrame.

In [10]:
driver=webdriver.Chrome()

In [11]:
driver.get('https://www.jagranjosh.com/')

In [12]:
gk=driver.find_element(By.XPATH,'/html/body/div/header/nav/div/div/div[3]/ul/li[3]/a')
gk.click()

In [14]:
pm=driver.find_element(By.XPATH,'/html/body/div[1]/div[8]/section[8]/div/ul/li[10]/a')
pm.click()

In [15]:
table=driver.find_element(By.XPATH,'/html/body/div[1]/main/div[1]/div[1]/article/div[3]/div[5]/div')

In [17]:
Title=[]

In [21]:
title=driver.find_elements(By.XPATH,'//div[@class="TableData"]//tr')
for i in title:
    title=i.text
    Title.append(title)

In [23]:
Title

['S.N.\nPM Name\nBorn-Dead\nTerm of office\nRemark',
 '1.\nJawahar Lal Nehru\n(1889–1964)\n15 August 1947 to 27 May 1964\n16 years, 286 days\nThe first prime minister of India and the longest-serving PM of India, the first to die in office.',
 '2.\nGulzarilal Nanda (Acting)\n(1898-1998)\n27 May 1964 to 9 June 1964,\n13 days\nFirst acting PM of India',
 "3.\nLal Bahadur Shastri\n(1904–1966)\n9 June 1964 to 11 January 1966\n1 year, 216 days\nHe has given the slogan of 'Jai Jawan Jai Kisan' during the Indo-Pak war of 1965",
 '4. \nGulzari Lal Nanda  (Acting)\n(1898-1998)\n11 January 1966 to 24 January 1966\n13 days\n-',
 '5.\nIndira Gandhi\n(1917–1984)\n24 January 1966 to 24 March 1977\n11 years, 59 days\nFirst female Prime Minister of India',
 '6.\nMorarji Desai\n(1896–1995)\n24 March 1977 to  28 July 1979 \n2 year, 126 days\nOldest to become PM (81 years old) and first to resign from office',
 '7.\nCharan Singh\n(1902–1987)\n28 July 1979 to 14 January 1980\n170 days\nOnly PM who did not face the Parliament',
 '8.\nIndira Gandhi\n(1917–1984)\n14 January 1980 to 31 October 1984\n4 years, 291 days\nThe first lady who served as PM for the second term',
 '9.\nRajiv Gandhi\n(1944–1991)\n31 October 1984 to 2 December 1989\n5 years, 32 days\nYoungest to become PM (40 years old)',
 '10.\nV. P. Singh\n(1931–2008)\n2 December 1989 to 10 November 1990\n343 days\nFirst PM to step down after a vote of no confidence',
 '11.\nChandra Shekhar\n(1927–2007)\n10 November 1990 to 21 June 1991\n223 days\nHe belongs to  Samajwadi Janata Party',
 '12.\nP. V. Narasimha Rao\n(1921–2004)\n21 June 1991 to 16 May 1996\n4 years, 330 days\nFirst PM from South India',
 '13.\nAtal Bihari Vajpayee\n(1924- 2018)\n16 May 1996 to 1 June 1996\n16 days\nPM for shortest tenure',
 '14.\nH. D. Deve Gowda\n(born 1933)\n1 June 1996 to 21 April 1997\n324 days\nHe belongs to  Janata Dal',
 '15.\nInder Kumar Gujral\n(1919–2012)\n21 April 1997 to 19 March 1998 \n332 days\n------',
 '16.\nAtal Bihari Vajpayee\n(1924-2018)\n19 March 1998 to 22 May 2004 \n6 years, 64 days\n The first non-congress PM who completed a full term as PM',
 '17.\nManmohan Singh\n(born 1932)\n22 May 2004 to 26 May 2014   \n10 years, 4 days\n First Sikh PM',
 '18.\nNarendra Modi\n(born 1950)\n26 May 2014 - 2019\n4th Prime Minister of India who served two consecutive tenures',
 '19.\nNarendra Modi\n(born 1950)\n30 May 2019- Incumbent\nFirst non-congress PM with two consecutive tenures',
 'List of all Presidents of India List of Nicknames of Indian Prime Ministers']

In [29]:
df=pd.DataFrame({"Title":Title})

In [30]:
df

                                                Title
0    S.N.\nPM Name\nBorn-Dead\nTerm of office\nRemark
1   1.\nJawahar Lal Nehru\n(1889–1964)\n15 August ...
2   2.\nGulzarilal Nanda (Acting)\n(1898-1998)\n27...
3   3.\nLal Bahadur Shastri\n(1904–1966)\n9 June 1...
4   4. \nGulzari Lal Nanda  (Acting)\n(1898-1998)\...
5   5.\nIndira Gandhi\n(1917–1984)\n24 January 196...
6   6.\nMorarji Desai\n(1896–1995)\n24 March 1977 ...
7   7.\nCharan Singh\n(1902–1987)\n28 July 1979 to...
8   8.\nIndira Gandhi\n(1917–1984)\n14 January 198...
9   9.\nRajiv Gandhi\n(1944–1991)\n31 October 1984...
10  10.\nV. P. Singh\n(1931–2008)\n2 December 1989...
11  11.\nChandra Shekhar\n(1927–2007)\n10 November...
12  12.\nP. V. Narasimha Rao\n(1921–2004)\n21 June...
13  13.\nAtal Bihari Vajpayee\n(1924- 2018)\n16 Ma...
14  14.\nH. D. Deve Gowda\n(born 1933)\n1 June 199...
15  15.\nInder Kumar Gujral\n(1919–2012)\n21 April...
16  16.\nAtal Bihari Vajpayee\n(1924-2018)\n19 Mar...
17  17.\nManmohan Singh\n(born 1932)\n22 May 2004 ...
18  18.\nNarendra Modi\n(born 1950)\n26 May 2014 -...
19  19.\nNarendra Modi\n(born 1950)\n30 May 2019- ...
20  List of all Presidents of India List of Nickna...

Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e.
Car name and Price) from https://www.motor1.com/
This task will be done in following steps:
1. First get the webpage https://www.motor1.com/
2. Then You have to type in the search bar ’50 most expensive cars’
3. Then click on 50 most expensive carsin the world..
4. Then scrap the mentioned data and make the dataframe.

In [31]:
driver=webdriver.Chrome()

In [32]:
driver.get("https://www.motor1.com/")

In [33]:
search=driver.find_element(By.XPATH,'/html/body/div[10]/div[2]/div/div/div[3]/div/div/div/form/input')
search.send_keys("50 most expensive cars")

In [35]:
click=driver.find_element(By.XPATH,'/html/body/div[10]/div[2]/div/div/div[3]/div/div/div/form/button[1]')
click.click()

In [36]:
again=driver.find_element(By.XPATH,'/html/body/div[10]/div[9]/div/div[1]/div/div/div[2]/div/div[1]/h3/a')
again.click()

In [37]:
name=[]

In [38]:
nam=driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in nam:
    nam=i.text
    name.append(nam)

In [74]:
name

['Aston Martin Valour',
 'McLaren Elva',
 'Czinger 21C',
 'Ferrari Monza',
 'Gordon Murray T.33',
 'Koenigsegg Gemera',
 'Zenvo TSR-S',
 'Hennessey Venom F5',
 'Bentley Bacalar',
 'Hispano Suiza Carmen Boulogne',
 'Bentley Mulliner Batur',
 'Deus Vayanne',
 'SSC Tuatara',
 'Lotus Evija',
 'Aston Martin Vulcan',
 'Delage D12',
 'Ferrari Daytona SP3',
 'McLaren Speedtail',
 'Rimac Nevera',
 'Pagani Utopia',
 'Pininfarina Battista',
 'Gordon Murray T.50',
 'Lamborghini Countach',
 'Mercedes-AMG Project One',
 'Zenvo Aurora',
 'Aston Martin Victor',
 'Hennessey Venom F5 Roadster',
 'Koenigsegg Jesko',
 'Aston Martin Valkyrie',
 'W Motors Lykan Hypersport',
 'McLaren Solus',
 'Lamborghini Sian',
 'Koenigsegg CC850',
 'Bugatti Chiron Super Sport 300+',
 'Lamborghini Veneno',
 'Bugatti Bolide',
 'Pininfarina B95 Speedster',
 'Bugatti Mistral',
 'Pagani Huayra Imola',
 'Bugatti Divo',
 'SP Automotive Chaos',
 'Pagani Codalunga',
 '777 Hypercar',
 'Mercedes-Maybach Exelero',
 'Bugatti Centodieci',
 'Bugatti Chiron Profilée',
 'Rolls-Royce Sweptail',
 'Bugatti La Voiture Noire',
 'Rolls-Royce Boat Tail*',
 'Rolls-Royce La Rose Noire Droptail',
 'Most Expensive Cars In The World']

In [75]:
newname=name[:50]

In [78]:
newname

['Aston Martin Valour',
 'McLaren Elva',
 'Czinger 21C',
 'Ferrari Monza',
 'Gordon Murray T.33',
 'Koenigsegg Gemera',
 'Zenvo TSR-S',
 'Hennessey Venom F5',
 'Bentley Bacalar',
 'Hispano Suiza Carmen Boulogne',
 'Bentley Mulliner Batur',
 'Deus Vayanne',
 'SSC Tuatara',
 'Lotus Evija',
 'Aston Martin Vulcan',
 'Delage D12',
 'Ferrari Daytona SP3',
 'McLaren Speedtail',
 'Rimac Nevera',
 'Pagani Utopia',
 'Pininfarina Battista',
 'Gordon Murray T.50',
 'Lamborghini Countach',
 'Mercedes-AMG Project One',
 'Zenvo Aurora',
 'Aston Martin Victor',
 'Hennessey Venom F5 Roadster',
 'Koenigsegg Jesko',
 'Aston Martin Valkyrie',
 'W Motors Lykan Hypersport',
 'McLaren Solus',
 'Lamborghini Sian',
 'Koenigsegg CC850',
 'Bugatti Chiron Super Sport 300+',
 'Lamborghini Veneno',
 'Bugatti Bolide',
 'Pininfarina B95 Speedster',
 'Bugatti Mistral',
 'Pagani Huayra Imola',
 'Bugatti Divo',
 'SP Automotive Chaos',
 'Pagani Codalunga',
 '777 Hypercar',
 'Mercedes-Maybach Exelero',
 'Bugatti Centodieci',
 'Bugatti Chiron Profilée',
 'Rolls-Royce Sweptail',
 'Bugatti La Voiture Noire',
 'Rolls-Royce Boat Tail*',
 'Rolls-Royce La Rose Noire Droptail']

In [79]:
len(newname)

50

In [51]:
Price1=[]

In [52]:
pric=driver.find_elements(By.XPATH,'//strong')
for i in pric:
    pric=i.text.replace("'Price:",'')
    Price1.append(pric)

In [53]:
Price1

['Price: $1.5 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.8 Million',
 'Price: $1.9 Million',
 'Price: $1.9 Million',
 'Price: $2.0 Million',
 'Price: $2.0 Million',
 'Price: $2.0 Million',
 'Price: $2.1 Million',
 'Price: $2.3 Million',
 'Price: $2.3 Million',
 'Price: $2.3 Million',
 'Price: $2.3 Million',
 'Price: $2.4 Million',
 'Price: $2.5 Million',
 'Price: $2.5 Million',
 'Price: $2.6 Million',
 'Price: $2.6 Million',
 'Price: $2.7 Million',
 'Price: $2.8 Million',
 'Price: $3.0 Million',
 '$3.0 Million',
 'Price: $3.0 Million',
 'Price: $3.2 Million',
 'Price: $3.4 Million',
 '$3.5 Million',
 'Price: $3.6 million',
 'Price: $3.7 Million',
 'Price: $3.9 Million',
 'Price: $4.5 Million',
 'Price: $4.7 Million',
 'Price: $4.8 Million',
 'Price: $5.0 Million',
 'Price: $5.4 Million',
 'Price: $5.8 Million',
 'Price: $6.4 Million',
 'Price: $7.4 Million',
 'Price: $7.5 Million',
 'Price: $8.0 Million',
 'Price: $9.0 Million',
 'Price: $10.8 Million',
 'Price: $12.8 Million',
 'Price: $13.4 Million',
 'Price: $28.0 Million (est.)',
 'Price: $30 Million (est.)']

In [55]:
df=pd.DataFrame({"Price":Price1})

In [56]:
df

                          Price
0           Price: $1.5 Million
1           Price: $1.7 Million
2           Price: $1.7 Million
3           Price: $1.7 Million
4           Price: $1.7 Million
5           Price: $1.7 Million
6           Price: $1.7 Million
7           Price: $1.8 Million
8           Price: $1.9 Million
9           Price: $1.9 Million
10          Price: $2.0 Million
11          Price: $2.0 Million
12          Price: $2.0 Million
13          Price: $2.1 Million
14          Price: $2.3 Million
15          Price: $2.3 Million
16          Price: $2.3 Million
17          Price: $2.3 Million
18          Price: $2.4 Million
19          Price: $2.5 Million
20          Price: $2.5 Million
21          Price: $2.6 Million
22          Price: $2.6 Million
23          Price: $2.7 Million
24          Price: $2.8 Million
25          Price: $3.0 Million
26                 $3.0 Million
27          Price: $3.0 Million
28          Price: $3.2 Million
29          Price: $3.4 Million
30                 $3.5 Million
31          Price: $3.6 million
32          Price: $3.7 Million
33          Price: $3.9 Million
34          Price: $4.5 Million
35          Price: $4.7 Million
36          Price: $4.8 Million
37          Price: $5.0 Million
38          Price: $5.4 Million
39          Price: $5.8 Million
40          Price: $6.4 Million
41          Price: $7.4 Million
42          Price: $7.5 Million
43          Price: $8.0 Million
44          Price: $9.0 Million
45         Price: $10.8 Million
46         Price: $12.8 Million
47         Price: $13.4 Million
48  Price: $28.0 Million (est.)
49    Price: $30 Million (est.)

In [81]:
df1=pd.DataFrame({"NAME":newname,"Price":Price1})

In [83]:
df1

                                  NAME                        Price
0                  Aston Martin Valour          Price: $1.5 Million
1                         McLaren Elva          Price: $1.7 Million
2                          Czinger 21C          Price: $1.7 Million
3                        Ferrari Monza          Price: $1.7 Million
4                   Gordon Murray T.33          Price: $1.7 Million
5                    Koenigsegg Gemera          Price: $1.7 Million
6                          Zenvo TSR-S          Price: $1.7 Million
7                   Hennessey Venom F5          Price: $1.8 Million
8                      Bentley Bacalar          Price: $1.9 Million
9        Hispano Suiza Carmen Boulogne          Price: $1.9 Million
10              Bentley Mulliner Batur          Price: $2.0 Million
11                        Deus Vayanne          Price: $2.0 Million
12                         SSC Tuatara          Price: $2.0 Million
13                         Lotus Evija          Price: $2.1 Million
14                 Aston Martin Vulcan          Price: $2.3 Million
15                          Delage D12          Price: $2.3 Million
16                 Ferrari Daytona SP3          Price: $2.3 Million
17                   McLaren Speedtail          Price: $2.3 Million
18                        Rimac Nevera          Price: $2.4 Million
19                       Pagani Utopia          Price: $2.5 Million
20                Pininfarina Battista          Price: $2.5 Million
21                  Gordon Murray T.50          Price: $2.6 Million
22                Lamborghini Countach          Price: $2.6 Million
23            Mercedes-AMG Project One          Price: $2.7 Million
24                        Zenvo Aurora          Price: $2.8 Million
25                 Aston Martin Victor          Price: $3.0 Million
26         Hennessey Venom F5 Roadster                 $3.0 Million
27                    Koenigsegg Jesko          Price: $3.0 Million
28               Aston Martin Valkyrie          Price: $3.2 Million
29           W Motors Lykan Hypersport          Price: $3.4 Million
30                       McLaren Solus                 $3.5 Million
31                    Lamborghini Sian          Price: $3.6 million
32                    Koenigsegg CC850          Price: $3.7 Million
33     Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34                  Lamborghini Veneno          Price: $4.5 Million
35                      Bugatti Bolide          Price: $4.7 Million
36           Pininfarina B95 Speedster          Price: $4.8 Million
37                     Bugatti Mistral          Price: $5.0 Million
38                 Pagani Huayra Imola          Price: $5.4 Million
39                        Bugatti Divo          Price: $5.8 Million
40                 SP Automotive Chaos          Price: $6.4 Million
41                    Pagani Codalunga          Price: $7.4 Million
42                        777 Hypercar          Price: $7.5 Million
43            Mercedes-Maybach Exelero          Price: $8.0 Million
44                  Bugatti Centodieci          Price: $9.0 Million
45             Bugatti Chiron Profilée         Price: $10.8 Million
46                Rolls-Royce Sweptail         Price: $12.8 Million
47            Bugatti La Voiture Noire         Price: $13.4 Million
48              Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)
49  Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)

In [88]:
df4=df1["Price"].str.replace("Price:","",case=False)

In [89]:
df4

0              $1.5 Million
1              $1.7 Million
2              $1.7 Million
3              $1.7 Million
4              $1.7 Million
5              $1.7 Million
6              $1.7 Million
7              $1.8 Million
8              $1.9 Million
9              $1.9 Million
10             $2.0 Million
11             $2.0 Million
12             $2.0 Million
13             $2.1 Million
14             $2.3 Million
15             $2.3 Million
16             $2.3 Million
17             $2.3 Million
18             $2.4 Million
19             $2.5 Million
20             $2.5 Million
21             $2.6 Million
22             $2.6 Million
23             $2.7 Million
24             $2.8 Million
25             $3.0 Million
26             $3.0 Million
27             $3.0 Million
28             $3.2 Million
29             $3.4 Million
30             $3.5 Million
31             $3.6 million
32             $3.7 Million
33             $3.9 Million
34             $4.5 Million
35             $4.7 Million
36             $4.8 Million
37             $5.0 Million
38             $5.4 Million
39             $5.8 Million
40             $6.4 Million
41             $7.4 Million
42             $7.5 Million
43             $8.0 Million
44             $9.0 Million
45            $10.8 Million
46            $12.8 Million
47            $13.4 Million
48     $28.0 Million (est.)
49       $30 Million (est.)
Name: Price, dtype: object